{
  "Unit 1": {
    "2": [
      {
        "question": "What are the different types of mobile applications?",
        "bt": "Understand"
      },
      {
        "question": "Explain the role of an IDE in mobile app development.",
        "bt": "Understand"
      },
      {
        "question": "Define mobile application architecture.",
        "bt": "Understand"
      },
      {
        "question": "What is the importance of cross-platform development?",
        "bt": "Understand"
      }
    ],
    "5": [
      {
        "question": "Describe the components of an Android application.",
        "bt": "Understand"
      },
      {
        "question": "Explain the importance of Gradle in Android development.",
        "bt": "Understand"
      },
      {
        "question": "How does the Android emulator assist in development and testing?",
        "bt": "Understand"
      },
      {
        "question": "What are the key differences between activities and services?",
        "bt": "Understand"
      }
    ],
    "10": [
      {
        "question": "Discuss the Android activity lifecycle and its significance in app development.",
        "bt": "Analyze"
      },
      {
        "question": "Analyze the impact of mobile UI/UX design on app success.",
        "bt": "Analyze"
      },
      {
        "question": "Compare and contrast different mobile development platforms (Android, iOS, Flutter).",
        "bt": "Analyze"
      },
      {
        "question": "Illustrate the end-to-end process of creating and deploying a simple Android app.",
        "bt": "Create"
      }
    ]
  },
  "Unit 2": {
    "2": [
      {
        "question": "What are the differences between native and hybrid mobile applications?",
        "bt": "Understand"
      },
      {
        "question": "Explain how UI components are handled in Android applications.",
        "bt": "Understand"
      },
      { "question": "What is the use of the Android SDK?", "bt": "Understand" },
      {
        "question": "Mention any two layout types in Android.",
        "bt": "Understand"
      }
    ],
    "5": [
      {
        "question": "What is the role of Android's 'Manifest' file?",
        "bt": "Understand"
      },
      {
        "question": "How do you handle background tasks in Android?",
        "bt": "Understand"
      },
      {
        "question": "Explain the use of AsyncTask in Android.",
        "bt": "Understand"
      },
      {
        "question": "Describe the role of intents in Android development.",
        "bt": "Understand"
      }
    ],
    "10": [
      {
        "question": "Implement an Android app that retrieves data from an external API.",
        "bt": "Create"
      },
      {
        "question": "Create an Android application that displays a list of items using ListView and interacts with user inputs.",
        "bt": "Create"
      },
      {
        "question": "Develop a weather app using any public API and display the results in a structured layout.",
        "bt": "Create"
      },
      {
        "question": "Build an app that uses Retrofit for networking and displays JSON data in a RecyclerView.",
        "bt": "Create"
      }
    ]
  },
  "Unit 3": {
    "2": [
      {
        "question": "What is the significance of Android's permission system?",
        "bt": "Understand"
      },
      {
        "question": "Explain the concept of Fragments in Android development.",
        "bt": "Understand"
      },
      {
        "question": "What is the purpose of the onResume() method in Android?",
        "bt": "Understand"
      },
      {
        "question": "What is a broadcast receiver in Android?",
        "bt": "Understand"
      }
    ],
    "5": [
      {
        "question": "How do you implement a RecyclerView in Android?",
        "bt": "Understand"
      },
      {
        "question": "What are Android services, and how are they used?",
        "bt": "Understand"
      },
      {
        "question": "Compare static and dynamic registration of broadcast receivers.",
        "bt": "Understand"
      },
      {
        "question": "Explain how to manage runtime permissions in Android.",
        "bt": "Understand"
      }
    ],
    "10": [
      {
        "question": "Design an Android app that utilizes a RecyclerView for displaying data.",
        "bt": "Create"
      },
      {
        "question": "Build an Android application that uses fragments to switch between different sections of the UI.",
        "bt": "Create"
      },
      {
        "question": "Create an app that integrates a service to download files in the background and notifies the user upon completion.",
        "bt": "Create"
      },
      {
        "question": "Develop a media player app that handles playback in the background using services and notifications.",
        "bt": "Create"
      }
    ]
  }
}
